### Pandas
+ **Series** (Similar to lists or numpy array)
+ **DataFrames**
+ **Panels**

In [2]:
import pandas as pd
import numpy as np
pd.__version__

'0.24.2'

#### Series
+ From List,tuple,dictionary
+ From numpy array

In [3]:
np.array([1,2,3])

array([1, 2, 3])

In [4]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [7]:
s=pd.Series([1,2,3],index=['a','b','c'])
s

a    1
b    2
c    3
dtype: int64

In [9]:
print(s['a'],s[0])

1 1

In [11]:
print(s[0:2])

a    1
b    2
dtype: int64

In [12]:
print(s['a':'c'])

a    1
b    2
c    3
dtype: int64

In [13]:
s.index=['suri','boori','gaari']

In [14]:
s

suri     1
boori    2
gaari    3
dtype: int64

In [15]:
d={"name":["surya","krishna","subbareddy"],
  "role":["desiboy","playboy","lifeboy"]}

In [16]:
pd.Series(d)

name    [surya, krishna, subbareddy]
role     [desiboy, playboy, lifeboy]
dtype: object

In [17]:
d={'maths':87,'science':81,'social':90}

In [18]:
pd.Series(d)

maths      87
science    81
social     90
dtype: int64

In [19]:
pd.date_range('2019-12-23','2019-12-30')

DatetimeIndex(['2019-12-23', '2019-12-24', '2019-12-25', '2019-12-26',
               '2019-12-27', '2019-12-28', '2019-12-29', '2019-12-30'],
              dtype='datetime64[ns]', freq='D')

In [20]:
pd.date_range('2019-11-23',periods=5)

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27'],
              dtype='datetime64[ns]', freq='D')

In [22]:
temp=pd.Series([32,29,30,31],pd.date_range('2019-11-23',periods=4))

In [23]:
temp

2019-11-23    32
2019-11-24    29
2019-11-25    30
2019-11-26    31
Freq: D, dtype: int64

In [24]:
temp.index

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26'], dtype='datetime64[ns]', freq='D')

In [25]:
s.index

Index(['suri', 'boori', 'gaari'], dtype='object')

### DataFrame
+ From Dictionary
+ From numpy 2D array

In [45]:
d={"name":["surya","krishna","subbareddy"],
  "role":["desiboy","playboy","lifeboy"]}
df=pd.DataFrame(d)
df.index=['a','b','c']
df

         name     role
a       surya  desiboy
b     krishna  playboy
c  subbareddy  lifeboy

In [33]:
a2=np.array([['Suri','Rami',"Subby"],[30,40,50]])

In [34]:
pd.DataFrame(a2)

      0     1      2
0  Suri  Rami  Subby
1    30    40     50

In [50]:
d["category"]=['Topper',"Gold medelist","Human Scientist"]
d

{'name': ['surya', 'krishna', 'subbareddy'],
 'role': ['desiboy', 'playboy', 'lifeboy'],
 'category': ['Topper', 'Gold medelist', 'Human Scientist']}

In [51]:
df=pd.DataFrame(d)
df

         name     role         category
0       surya  desiboy           Topper
1     krishna  playboy    Gold medelist
2  subbareddy  lifeboy  Human Scientist

In [54]:
a1=np.array((["Surya",85,95,45,90],["Krish",90,75,85,90]))
a2=np.array(["Name","Science","Maths","Social","English"])

In [57]:
df_1=pd.DataFrame(a1,columns=a2)
df_1

    Name Science Maths Social English
0  Surya      85    95     45      90
1  Krish      90    75     85      90

In [262]:
df_csv=pd.read_csv('sample.csv')

In [263]:
df_csv

  Priyaranjan    85   67
0    Suryasri  95.0   77
1      Ramesh  77.0   77
2    Praneeth  89.0   90
3      Rajesh  99.0  100
4       Krish  91.0   99
5        Muni  99.0  100
6        Mahi   NaN   65

In [68]:
df_csv=pd.read_csv('sample.csv',header=None)

df_csv

             0      1        2
0         Name  Maths  Science
1  Priyaranjan     85       67
2     Suryasri     95       77

In [266]:
df_csv=pd.read_csv('sample.csv',names=['Names','Telugu','English'])

In [267]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

In [268]:
df_csv.Telugu

0    85.0
1    95.0
2    77.0
3    89.0
4    99.0
5    91.0
6    99.0
7     NaN
Name: Telugu, dtype: float64

In [269]:
df_csv[['Names']]

         Names
0  Priyaranjan
1     Suryasri
2       Ramesh
3     Praneeth
4       Rajesh
5        Krish
6         Muni
7         Mahi

In [270]:
df_csv[['Names','English']]

         Names  English
0  Priyaranjan       67
1     Suryasri       77
2       Ramesh       77
3     Praneeth       90
4       Rajesh      100
5        Krish       99
6         Muni      100
7         Mahi       65

In [271]:
df_csv.values

array([['Priyaranjan', 85.0, 67],
       ['Suryasri', 95.0, 77],
       ['Ramesh', 77.0, 77],
       ['Praneeth', 89.0, 90],
       ['Rajesh', 99.0, 100],
       ['Krish', 91.0, 99],
       ['Muni', 99.0, 100],
       ['Mahi', nan, 65]], dtype=object)

In [272]:
df_csv.columns

Index(['Names', 'Telugu', 'English'], dtype='object')

In [273]:
df_csv.dtypes

Names       object
Telugu     float64
English      int64
dtype: object

In [274]:
df_csv.index

RangeIndex(start=0, stop=8, step=1)

In [275]:
df_csv.shape

(8, 3)

#### Indexing
+ Position based indexing
+ Label based indexing

In [276]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

In [277]:
df_csv.iloc[4,1:3]

Telugu      99
English    100
Name: 4, dtype: object

In [278]:
df_csv.iloc[4:6,:]

    Names  Telugu  English
4  Rajesh    99.0      100
5   Krish    91.0       99

In [279]:
df_csv.iloc[2,2]

77

In [280]:
df_csv.iloc[:,2]

0     67
1     77
2     77
3     90
4    100
5     99
6    100
7     65
Name: English, dtype: int64

In [281]:
df_csv.iloc[:,1]

0    85.0
1    95.0
2    77.0
3    89.0
4    99.0
5    91.0
6    99.0
7     NaN
Name: Telugu, dtype: float64

In [282]:
df_csv[[0,1,2],[0,1,2]]

TypeError: '([0, 1, 2], [0, 1, 2])' is an invalid key

### iloc

In [ ]:
df_csv.loc[0,'Names']

In [ ]:
df_csv.loc[2:4,['Names','English','Telugu']]

In [283]:
df_csv[['Names','Telugu']]

         Names  Telugu
0  Priyaranjan    85.0
1     Suryasri    95.0
2       Ramesh    77.0
3     Praneeth    89.0
4       Rajesh    99.0
5        Krish    91.0
6         Muni    99.0
7         Mahi     NaN

In [284]:
df_csv.set_index(['Names'])

             Telugu  English
Names
Priyaranjan    85.0       67
Suryasri       95.0       77
Ramesh         77.0       77
Praneeth       89.0       90
Rajesh         99.0      100
Krish          91.0       99
Muni           99.0      100
Mahi            NaN       65

In [285]:
df_csv.loc["'Suryasri'",'Telugu']

KeyError: "'Suryasri'"

In [ ]:
df.info()

In [ ]:
df_csv['Sum']=df_csv['Telugu']+df_csv['English']

In [286]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

In [287]:
df_csv.sum(axis=0) ## Adding the data row wise

Names      PriyaranjanSuryasriRameshPraneethRajeshKrishMu...
Telugu                                                   635
English                                                  675
dtype: object

In [288]:
df_csv.sum(axis=1) ## Adding the data column wise

0    152.0
1    172.0
2    154.0
3    179.0
4    199.0
5    190.0
6    199.0
7     65.0
dtype: float64

In [289]:
df_csv.describe()

          Telugu     English
count   7.000000    8.000000
mean   90.714286   84.375000
std     7.952238   14.735162
min    77.000000   65.000000
25%    87.000000   74.500000
50%    91.000000   83.500000
75%    97.000000   99.250000
max    99.000000  100.000000

In [290]:
df_csv.describe(include=np.int64)

          English
count    8.000000
mean    84.375000
std     14.735162
min     65.000000
25%     74.500000
50%     83.500000
75%     99.250000
max    100.000000

### Check the
+ head
+ tail
+ shape
+ columns
+ dtypes
+ index
+ info
+ describe

In [291]:
s_df=pd.read_csv('student.csv',names=['Names','College','Program'])

In [292]:
s_df

    Names College           Program
0   Krish    IIIT  Machine Learning
1   Rishi   IGIAT            Python
2    Gopi  Vignan            python
3  Lokesh  Vignan            python
4  Rajesh    IIIT       DataScience
5   Kumar   RAGHU       DataScience

In [293]:
### Head - By default first 5 rows of data
s_df.head()

    Names College           Program
0   Krish    IIIT  Machine Learning
1   Rishi   IGIAT            Python
2    Gopi  Vignan            python
3  Lokesh  Vignan            python
4  Rajesh    IIIT       DataScience

In [294]:
s_df.head(2) ## First two rows

   Names College           Program
0  Krish    IIIT  Machine Learning
1  Rishi   IGIAT            Python

In [295]:
s_df.head()[2:5] ## Slicing (Getting data from 2nd row to 5th row)

    Names College      Program
2    Gopi  Vignan       python
3  Lokesh  Vignan       python
4  Rajesh    IIIT  DataScience

In [296]:
s_df.tail() ## Getting Last 5 rows of data

    Names College      Program
1   Rishi   IGIAT       Python
2    Gopi  Vignan       python
3  Lokesh  Vignan       python
4  Rajesh    IIIT  DataScience
5   Kumar   RAGHU  DataScience

In [297]:
s_df.shape ## Number of rows and columns

(6, 3)

In [298]:
s_df.columns ## Getting number of columns

Index(['Names', 'College', 'Program'], dtype='object')

In [299]:
s_df.dtypes ## Getting data types

Names      object
College    object
Program    object
dtype: object

In [300]:
s_df.index ## Getting index range

RangeIndex(start=0, stop=6, step=1)

In [301]:
s_df.info ## Total info of a dataFrame

<bound method DataFrame.info of     Names College           Program
0   Krish    IIIT  Machine Learning
1   Rishi   IGIAT            Python
2    Gopi  Vignan            python
3  Lokesh  Vignan            python
4  Rajesh    IIIT       DataScience
5   Kumar   RAGHU       DataScience>

In [302]:
s_df.describe()

       Names College Program
count      6       6       6
unique     6       4       4
top     Gopi  Vignan  python
freq       1       2       2

In [303]:
s_df.College.value_counts()

Vignan    2
IIIT      2
IGIAT     1
RAGHU     1
Name: College, dtype: int64

In [304]:
s_df.College.nunique()

4

In [305]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

In [306]:
s_df

    Names College           Program
0   Krish    IIIT  Machine Learning
1   Rishi   IGIAT            Python
2    Gopi  Vignan            python
3  Lokesh  Vignan            python
4  Rajesh    IIIT       DataScience
5   Kumar   RAGHU       DataScience

In [307]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

### Merging
+ Inner
+ Outer
+ Left
+ Righ

In [308]:
pd.merge(df_csv,s_df,on="Names") ## By default its inner mergea

    Names  Telugu  English College           Program
0  Rajesh    99.0      100    IIIT       DataScience
1   Krish    91.0       99    IIIT  Machine Learning

In [309]:
pd.merge(df_csv,s_df,on="Names", how="outer") ## Outer join union

          Names  Telugu  English College           Program
0   Priyaranjan    85.0     67.0     NaN               NaN
1      Suryasri    95.0     77.0     NaN               NaN
2        Ramesh    77.0     77.0     NaN               NaN
3      Praneeth    89.0     90.0     NaN               NaN
4        Rajesh    99.0    100.0    IIIT       DataScience
5         Krish    91.0     99.0    IIIT  Machine Learning
6          Muni    99.0    100.0     NaN               NaN
7          Mahi     NaN     65.0     NaN               NaN
8         Rishi     NaN      NaN   IGIAT            Python
9          Gopi     NaN      NaN  Vignan            python
10       Lokesh     NaN      NaN  Vignan            python
11        Kumar     NaN      NaN   RAGHU       DataScience

In [310]:
pd.merge(df_csv,s_df,on="Names",how="inner") ### Inner merge

    Names  Telugu  English College           Program
0  Rajesh    99.0      100    IIIT       DataScience
1   Krish    91.0       99    IIIT  Machine Learning

In [311]:
pd.merge(df_csv,s_df, on="Names", how="right") ### Right merge

    Names  Telugu  English College           Program
0  Rajesh    99.0    100.0    IIIT       DataScience
1   Krish    91.0     99.0    IIIT  Machine Learning
2   Rishi     NaN      NaN   IGIAT            Python
3    Gopi     NaN      NaN  Vignan            python
4  Lokesh     NaN      NaN  Vignan            python
5   Kumar     NaN      NaN   RAGHU       DataScience

In [312]:
pd.merge(df_csv,s_df, on="Names", how="left") ### Left merge

         Names  Telugu  English College           Program
0  Priyaranjan    85.0       67     NaN               NaN
1     Suryasri    95.0       77     NaN               NaN
2       Ramesh    77.0       77     NaN               NaN
3     Praneeth    89.0       90     NaN               NaN
4       Rajesh    99.0      100    IIIT       DataScience
5        Krish    91.0       99    IIIT  Machine Learning
6         Muni    99.0      100     NaN               NaN
7         Mahi     NaN       65     NaN               NaN

In [313]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0       67
1     Suryasri    95.0       77
2       Ramesh    77.0       77
3     Praneeth    89.0       90
4       Rajesh    99.0      100
5        Krish    91.0       99
6         Muni    99.0      100
7         Mahi     NaN       65

In [314]:
df_csv[df_csv['Telugu']>90]

      Names  Telugu  English
1  Suryasri    95.0       77
4    Rajesh    99.0      100
5     Krish    91.0       99
6      Muni    99.0      100

In [315]:
df_csv[(df_csv['Telugu']>90) & (df_csv['English']>80)]['Sum'] ## Getting sum values based on column values range

KeyError: 'Sum'

In [ ]:
s_df[s_df['Program']=='Machine Learning']

In [ ]:
s_df[s_df['College']=="IIIT"]

In [ ]:
s_df[s_df['College']=='IGIAT']

In [ ]:
df_csv[df_csv['Names']=="Suryasri"]

In [ ]:
df_csv[df_csv['Telugu']>70]

In [ ]:
df_csv.sort_values('Telugu') ## Sorting values based on Telugu marks - Ascending order

In [316]:
df_csv.sort_values('English',ascending=False) ## Sorting values based on English Marks - Decending order

         Names  Telugu  English
4       Rajesh    99.0      100
6         Muni    99.0      100
5        Krish    91.0       99
3     Praneeth    89.0       90
1     Suryasri    95.0       77
2       Ramesh    77.0       77
0  Priyaranjan    85.0       67
7         Mahi     NaN       65

In [317]:
df_csv.sort_values('Names') ### Sorting values based on Names column

         Names  Telugu  English
5        Krish    91.0       99
7         Mahi     NaN       65
6         Muni    99.0      100
3     Praneeth    89.0       90
0  Priyaranjan    85.0       67
4       Rajesh    99.0      100
2       Ramesh    77.0       77
1     Suryasri    95.0       77

In [318]:
df_csv.isnull()

   Names  Telugu  English
0  False   False    False
1  False   False    False
2  False   False    False
3  False   False    False
4  False   False    False
5  False   False    False
6  False   False    False
7  False    True    False

In [319]:
df_csv.isnull().sum()

Names      0
Telugu     1
English    0
dtype: int64

In [320]:
df_csv.Telugu.min()

77.0

In [321]:
df_csv.Telugu.max()

99.0

In [322]:
df_csv.Telugu.mean()

90.71428571428571

In [323]:
df_csv.Telugu.median()

91.0

In [324]:
df_csv.Telugu.mode()

0    99.0
dtype: float64

In [333]:
df_csv['Telugu']

0    85.000000
1    95.000000
2    77.000000
3    89.000000
4    99.000000
5    91.000000
6    99.000000
7    90.714286
Name: Telugu, dtype: float64

In [332]:
# df_csv['Telugu'].fillna(df_csv['Telugu'].mean())
df_csv

         Names     Telugu  English
0  Priyaranjan  85.000000       67
1     Suryasri  95.000000       77
2       Ramesh  77.000000       77
3     Praneeth  89.000000       90
4       Rajesh  99.000000      100
5        Krish  91.000000       99
6         Muni  99.000000      100
7         Mahi  90.714286       65

In [331]:
df_csv.dropna(axis=1)

         Names     Telugu  English
0  Priyaranjan  85.000000       67
1     Suryasri  95.000000       77
2       Ramesh  77.000000       77
3     Praneeth  89.000000       90
4       Rajesh  99.000000      100
5        Krish  91.000000       99
6         Muni  99.000000      100
7         Mahi  90.714286       65

In [338]:
df_csv.drop('Telugu',axis=1) ## Droping a column along with data

         Names  English
0  Priyaranjan       67
1     Suryasri       77
2       Ramesh       77
3     Praneeth       90
4       Rajesh      100
5        Krish       99
6         Muni      100
7         Mahi       65

In [342]:
df_csv.drop("'Muni'")

KeyError: '["\'Muni\'"] not found in axis'

In [343]:
df_csv.describe().dtypes

Telugu     float64
English    float64
dtype: object

In [345]:
df_csv.describe().columns

Index(['Telugu', 'English'], dtype='object')

In [346]:
num_cols=df_csv.columns[df_csv.dtypes!=object]

In [347]:
print(num_cols)

Index(['Telugu', 'English'], dtype='object')

In [350]:
# for col in num_cols:
#     df_csv.fillna(df_csv[col].mean(),inplace=True)

In [351]:
df_csv

         Names     Telugu  English
0  Priyaranjan  85.000000       67
1     Suryasri  95.000000       77
2       Ramesh  77.000000       77
3     Praneeth  89.000000       90
4       Rajesh  99.000000      100
5        Krish  91.000000       99
6         Muni  99.000000      100
7         Mahi  90.714286       65

In [356]:
df_csv=pd.read_csv("sample.csv",names=["Names","Telugu","English"])

In [357]:
df_csv

         Names  Telugu  English
0  Priyaranjan    85.0     67.0
1     Suryasri    95.0     77.0
2       Ramesh    77.0     77.0
3     Praneeth    89.0     90.0
4       Rajesh    99.0    100.0
5        Krish    91.0     99.0
6         Muni    99.0    100.0
7         Mahi     NaN     65.0
8       kalyan     NaN      NaN

In [354]:
num_col=df_csv.columns[df_csv.dtypes!=object]

In [361]:
# for col in num_col:
#     df_csv.fillna(df_csv[col].mean(),inplace=True)
for col in num_col:
    df_csv.fillna(df_csv[col].mean(),inplace=True)

KeyError: '85'

In [359]:
for col in num_cols:
    df_csv.fillna(df_csv[col].mean(),inplace=True)

### GroupBy

In [ ]:
df_csv=pd.read_csv("sample.csv",names={"Names","Telugu","English","Science","Maths"})